#include <stdio.h>

int main() {
    // Декларация vs дефиниция vs инициализация
    // Синтаксис: <тип> <име_на_променлива> = <стойност>;

    // Декларация + дефиниция (без инициализация)
    int myInt; // паметта съдържа неопределена стойност (често наричана "боклук")
    printf("Uninitialized value --> %d\n", myInt); // четенето ѝ е недефинирано поведение

    // Присвояване (Assignment)
    myInt = 42;
    printf("New value in memory --> %d\n", myInt);

    // Декларация + дефиниция с инициализация
    int myOtherInt = 100;
    printf("myOtherInt value in memory --> %d\n", myOtherInt);

    /*
        Декларация:    въвежда името и типа (казва на компилатора, че това име съществува);
        Дефиниция:     създава самия обект, т.е. заделя памет за него
                       (за глобалните променливи именно тя е символът, който линкерът търси);
        Инициализация: задава начална стойност в момента на дефиницията;
    */

    // const променливите трябва да се инициализират при дефиницията, защото после не могат да се променят
    const int   FINGERS_ON_MY_HAND  = 10;
    const float PI                  = 3.141592f;

    // това ще доведе до грешка при компилация
    // PI = 2;
}